# IsCategorySupported Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementIntersectsFilter..::..IsCategorySupported Method
ElementIntersectsFilter Class See Also
---
Identifies if the input element is of a category supported by element intersection filters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static bool IsCategorySupported(
	Element element
)
```

Visual Basic
---
```text
Public Shared Function IsCategorySupported ( _
	element As Element _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsCategorySupported(
	Element^ element
)
```

# ### Parameters
element
    Type: Autodesk.Revit.DB..::..Element The element.
# ### Return Value
True if the element category is supported, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElementIntersectsFilter Class
Autodesk.Revit.DB Namespace